app/Models/ModelJenjang.php

SELECT *
FROM `tbl_jenjang`
---
    public function AllData()
    {
        return $this->db->table('tbl_jenjang')
                        ->get()
                        ->getResultArray();

UPDATE `tbl_jenjang` SET `id_jenjang` = '4', `marker` = '1769078992_22ab267092f27c4e6512.png'
WHERE `id_jenjang` = '4'
---
    public function UpdateData($data)
    {
        $this->db->table('tbl_jenjang')
        ->where('id_jenjang', $data['id_jenjang'])
        ->update($data);