app/Models/ModelSekolah.php

SELECT *
FROM `tbl_sekolah`
---
    public function AllData()
    {
        return $this->db->table('tbl_sekolah')
                        ->get()
                        ->getResultArray();