app/Models/ModelSekolah.php

    public function AllData()
    {
        return $this->db->table('tbl_sekolah')
         ->join('tbl_jenjang', 'tbl_jenjang.id_jenjang = tbl_sekolah.id_jenjang', 'left')
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `tbl_sekolah`
LEFT JOIN `tbl_jenjang` ON `tbl_jenjang`.`id_jenjang` = `tbl_sekolah`.`id_jenjang`

public  function DetailData($id_sekolah)
    {
        return $this->db->table('tbl_sekolah')
        ->join('tbl_jenjang', 'tbl_jenjang.id_jenjang = tbl_sekolah.id_jenjang', 'left')
        ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_sekolah.id_provinsi', 'left')
        ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_sekolah.id_kabupaten', 'left')
        ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_sekolah.id_kecamatan', 'left')
         ->join('tbl_wilayah', 'tbl_wilayah.id_wilayah = tbl_sekolah.id_wilayah', 'left')
        ->where('id_sekolah', $id_sekolah)
        ->get()
        ->getRowArray();
---
SELECT *
FROM `tbl_sekolah`
LEFT JOIN `tbl_jenjang` ON `tbl_jenjang`.`id_jenjang` = `tbl_sekolah`.`id_jenjang`
LEFT JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_sekolah`.`id_provinsi`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_sekolah`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_sekolah`.`id_kecamatan`
LEFT JOIN `tbl_wilayah` ON `tbl_wilayah`.`id_wilayah` = `tbl_sekolah`.`id_wilayah`
WHERE `id_sekolah` = '1'

    public function UpdateData($data)
    {
        $this->db->table('tbl_sekolah')
        ->where('id_sekolah', $data['id_sekolah'])
        ->update($data);
---
UPDATE `tbl_sekolah` SET `id_sekolah` = '1', `nama_sekolah` = 'SDN.1 LINGGAPURA', `akreditasi` = 'B', `status` = 'Negeri', `coordinat` = '-7.189910435127321,109.00966393723479', `id_jenjang` = '5', `id_provinsi` = '33', `id_kabupaten` = '3329', `id_kecamatan` = '3329060', `alamat` = 'Jln. Linggapura Masjid Attaqwa linggapura tngh', `id_wilayah` = '13', `foto` = 'sdnlinggapura01.jpeg'
WHERE `id_sekolah` = '1'

    public function allProvinsi()
    {
         return $this->db->table('tbl_provinsi')
         ->orderBy('id_provinsi','ASC')
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `tbl_provinsi`
ORDER BY `id_provinsi` ASC

    public function allKabupaten($id_provinsi)
    {
        return $this->db->table('tbl_kabupaten')
         ->where('id_provinsi', $id_provinsi)
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `tbl_kabupaten`
WHERE `id_provinsi` = '33'

    public function allKecamatan($id_kabupaten)
    {
        return $this->db->table('tbl_kecamatan')
         ->where('id_kabupaten', $id_kabupaten)
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `tbl_kecamatan`
WHERE `id_kabupaten` = '3329'