app/Models/ModelUser.php

    public function AllData()
    {
        return $this->db->table('tbl_user')
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `tbl_user`

    public function InsertData($data)
{
    $this->db->table('tbl_user')->insert($data);
---
INSERT INTO `tbl_user` (`nama_user`, `email`, `password`, `foto`) VALUES ('nnn', '  n', '7323a5431d1c31072983a6a5bf23745b655ddf59', '1768448176_d1aea2a248173bd06411.jpeg')

public  function DetailData($id_user)
    {
        return $this->db->table('tbl_user')
        ->where('id_user', $id_user)
        ->get()
        ->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `id_user` = '5'

    public function UpdateData($data)
    {
        $this->db->table('tbl_user')
        ->where('id_user', $data['id_user'])
        ->update($data);
---
UPDATE `tbl_user` SET `id_user` = '5', `nama_user` = 'isna', `email` = '  lalal@gmail.com', `password` = '67218a0ded19df327da9a16ac4d49353158910a5', `foto` = '1768448176_d1aea2a248173bd06411.jpeg'
WHERE `id_user` = '5'